In [1]:
import pandas as pd

In [3]:
df1 = pd.read_excel("./Aracaju.xlsx", )
df2 = pd.read_excel("./Fortaleza.xlsx")
df3 = pd.read_excel("./Natal.xlsx")
df4 = pd.read_excel("./Recife.xlsx")
df5 = pd.read_excel("./Salvador.xlsx")

In [4]:
df = pd.concat([df1,df2,df3,df4,df5])

In [8]:
    #retorno de 5 linhas aleatorias
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
133  Fortaleza 2019-03-02   14.67     980     7
138   Salvador 2019-03-02  212.03    1037     3
0     Salvador 2018-01-01   31.06    1037     3
19    Salvador 2019-01-01  167.12    1035     1
48      Recife 2019-01-01  141.19     980     7

In [10]:
df.dtypes
#conversao de valores
df['lojaID'] = df['LojaID'].astype("object")

In [11]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
lojaID            object
dtype: object

In [15]:
#retorno de valores nulos mais soma
df.isnull().sum()
#substituicao de valores nulos por media
df["tabela"].fillna(df["tabela"].mean(), inplace=True)

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
lojaID    0
dtype: int64

In [16]:
#cracao de colunas de Vendas X Quantidade
df['Receitas'] = df['Vendas'].mul(df["Qtde"])

In [20]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde lojaID  Receitas  receitas/vendas
0  Aracaju 2018-01-01  142.00    1520     1   1520    142.00              1.0
1  Aracaju 2018-01-01   14.21    1522     6   1522     85.26              6.0
2  Aracaju 2018-01-01   71.55    1520     1   1520     71.55              1.0
3  Aracaju 2018-01-01    3.01    1521     7   1521     21.07              7.0
4  Aracaju 2018-01-01   24.51    1522     8   1522    196.08              8.0

In [19]:
df['receitas/vendas'] = df["Receitas"] / df["Vendas"]

In [29]:
#exibe o numero maximo e minimo
df["Receitas"].min()
df["Receitas"].max()

3544.0

In [32]:
#retorno o maximo ou minimo dentro dos parametos informados sendo: quantidade de retornos e tabela de comparacao
df.nlargest(3, "Receitas")
df.nsmallest(3, "Receitas")

,Cidade,Data,Vendas,LojaID,Qtde,lojaID,Receitas,receitas/vendas
118,Aracaju,2018-01-01,3.34,1522,1,1522,3.34,1.0
65,Recife,2019-01-01,4.01,981,1,981,4.01,1.0
92,Natal,2019-01-02,4.57,1035,1,1035,4.57,1.0

In [37]:
df.groupby("Cidade")["Receitas"].sum()
#retorno de maiores receitas ordenadas
df.sort_values("Receitas", ascending=False).head(10)

   Cidade       Data  Vendas  LojaID  Qtde lojaID  Receitas  receitas/vendas
7   Natal 2019-03-18   886.0     853     4    853    3544.0              4.0
55  Natal 2019-01-08   859.0     854     4    854    3436.0              4.0
51  Natal 2018-01-21   859.0     852     4    852    3436.0              4.0
30  Natal 2018-10-02   856.0     853     4    853    3424.0              4.0
41  Natal 2018-05-20   835.0     852     4    852    3340.0              4.0
38  Natal 2018-02-25   828.0     852     4    852    3312.0              4.0
10  Natal 2018-10-27   828.0     852     4    852    3312.0              4.0
69  Natal 2019-03-24   817.0     852     4    852    3268.0              4.0
62  Natal 2018-02-10   793.0     854     4    854    3172.0              4.0
52  Natal 2018-04-27   778.0     854     4    854    3112.0              4.0